{"attach": "The term attach is used primarily on cards which can provide effects to certain other cards for an indeterminate amount of time, particularly Auras (see enchant), Equipment (see equip), and Fortifications (see fortify).  These types of cards are used by designating something (usually a permanent) for them to be \"attached\" to.\n", "counter": "To counter a spell or ability is to remove it from the stack without resolving its effects, putting it directly into its owner's graveyard.  Some spells and abilities have an additional clause that replaces the graveyard with another game zone.  There are instant spells that will explicitly counter other spells, generally known as \"counterspells\" after the original card with this effect.  Spells and abilities that have one or more targets are also countered by the game rules if they no longer have any legal targets, as would be the case if a targeted creature was returned to its owner's hand or if it gained hexproof.  A spell that is countered this way is said to have been ‘Countered Upon Resolution’ (formerly \"Fizzled\").  Some cards specify that they \"cannot be countered by spells or abilities\".  This only prevents the explicit method of countering spells; such a spell can still be countered by the game rules.\n", "exile": "To exile a card is to put it into the exile zone, usually as part of a card's effect.  With few exceptions, exiled cards can no longer have an effect on the game.  Starting from the Magic 2010 rules changes, cards that \"remove [something] from the game\" or \"set [something] aside\" were issued errata to say \"exile [something]\" instead.\n", "fight": "When two creatures fight each other, each creature deals damage equal to its power to the other creature.  Multiple creatures may fight each other at the same time.  Fight is a keyword action that has been sporadically printed in some form since the card Gargantuan Gorilla, but it was not keyworded until Innistrad.\n", "mill": "When a player Mills x cards, they put the top x cards of that library into their graveyard. Mill is an action that has been around since Antiquities with Millstone but was never given a keyword until M21.\n", "sacrifice": "To sacrifice a permanent is to put it into its owner's graveyard.  A player can only sacrifice a permanent he or she controls.  Note that this term is separate from other ways permanents can be put into their owners' graveyards, such as destruction (meaning regeneration has no effect on sacrifice) and state-based actions (a creature having 0 toughness, for example).  Players are not allowed to sacrifice unless prompted to by a game effect.\n", "scry": "Scry x allows the player to take the top x cards from their deck, examine them, and place any number of them on the bottom of their deck and the rest on top in any order desired.  Scry originally appeared in Fifth Dawn as a keyword ability, primarily on instants and sorceries as \"Scry 2\", though it was designed to allow other values. Future Sight added values 1 through 4 and redefined scry to be a keyword action, allowing it to be placed in the middle of an ability rather than as a \"tack-on\" to other abilities.  Scry then appeared in Magic 2011, becoming the first mechanic to be revisited in a core set. Scry also returned in Theros block before becoming an evergreen keyword in Magic Origins.\n", "tap/untap": "To tap a permanent is to rotate the card 90 degrees.  This indicates it is being used, often as a cost, or to indicate that a creature is attacking (except for creatures with vigilance).  Creatures a player controls that have not been under his or her control since the beginning of his or her most recent turn are said to have \"summoning sickness\" and cannot be tapped for their abilities that include the \"tap symbol\", nor can they attack, but they can be tapped for costs that use the word \"tap\" (for example, \"Tap two untapped creatures you control\").\n", "deathtouch": "Deathtouch is a static ability that causes a creature to be destroyed as a result of having been dealt damage by a source with deathtouch. In this way, for a creature with deathtouch, any nonzero amount of damage it deals to another creature is considered enough to kill it.  Deathtouch appears mostly on black cards and green cards, and is often thematically associated with poisonous or cursed creatures.  Prior to the introduction of the keyword, similar abilities have appeared mostly on green and black cards, but in most cases those abilities were functionally different (typically triggering on combat damage and/or at end of combat). This ability was first printed on a single timeshifted creature from Future Sight, Thornweald Archer. Older cards with similar or identical abilities, such as Cruel Deceiver, were not changed to gain deathtouch.\n", "defender": "Creatures with defender can't attack.  This ability was formerly associated with creature type Wall which had implicit \"rules baggage\" that prevented attacking.  This was simplified with the keyword, which was first used in the Kamigawa block.\n", "double strike": "A creature with double strike deals both first strike and normal combat damage.[7]  For instance, a creature such as Boros Swiftblade which has 1 power, 2 toughness, and double strike would defeat a creature with 2 power and 1 toughness in combat and survive, unless the latter creature also has first strike or double strike, as the first strike damage would destroy it before it would be able to deal damage.  If the latter creature instead has 2 toughness, both creatures will be destroyed as the opposing creature survived the first strike, after which both creatures would simultaneously deal regular combat damage to each other.  As with first strike, this keyword appears mostly on red and white cards.  It first appeared in Legions and was first used in a Core Set in Tenth Edition.\n", "enchant": "This ability is written Enchant (quality) and appears on Auras, a subtype of enchantment spells.  An Aura enters the battlefield attached to a permanent spell with the quality of its Enchant ability, and can only be attached to a permanent with that quality.  If an Aura is no longer attached to a permanent with the required quality (such as if the object it enchants leaves the battlefield), it is put into its owner's discard pile.  Like protection, the quality can be almost anything, but it normally has a permanent type associated with it, such as \"Enchant creature\".  This ability was formerly seen in the type line instead of \"Enchantment — Aura\"; the wording changed in the Ninth Edition core set, which introduced the Aura subtype.\n", "equip": "This ability is written Equip (cost).  It is found only on Equipment, a subtype of artifact spells that first appeared in Mirrodin.  A player may pay the Equip cost as a sorcery (only during his or her own main phase when the stack is empty) to attach it to a creature he or she controls.  That creature becomes \"equipped\" and can then be referenced by the equipment as the \"equipped creature\".  The controller may pay the Equip cost again to move it to another creature.  When a creature leaves the battlefield or stops being a creature by some effect, any equipment attached to it \"falls off\", becoming unattached but remaining on the battlefield.  Equipment does not \"fall off\" if another player gains control of either the creature or the equipment – the player who controls the equipment may pay the Equip cost to move it to a creature he or she controls.\n", "first strike": "Creatures with first strike deal damage before other creatures in combat.  Therefore, if a creature with first strike deals sufficient damage to kill an opposing creature without this ability, it will not suffer any combat damage from that creature in return.  First strike is often found on red and white creatures, especially soldiers and knights who carry pikes or lances.\n", "flash": "Flash is the keyword of an ability introduced in Mirage.[8] Artifacts, creatures or enchantments with flash may be played any time their controller could play an instant.  Older cards with that ability have been updated via rules errata to have flash; this allows them to work with cards such as Mystical Teachings.\n", "flying": "Creatures with flying can't be blocked except by other creatures with flying and/or reach.  Flying is the most common keyword, and appears in all five colors, but chiefly in blue and white.  Creatures with flying are often Dragons, Angels, Birds, and other creatures that have wings; flying can also be possessed by some monks and the Djinn.\n", "haste": "Creatures with the haste ability are able to attack and use abilities that involve the tap symbol on the turn a player gains control of them, instead of waiting until their controller's next turn. (An effect dubbed \"summoning sickness\" otherwise prevents a creature from attacking or using abilities with the tap symbol unless its controller controlled it since the start of their most recent turn.)  Haste is an example of a retroactive keywording, as cards from almost every earlier set have possessed \"may attack the turn [they] come into play\" or \"unaffected by summoning sickness\", which was replaced by the word \"haste\".  It was later changed to include untapping to activate abilities as well.  Creatures with haste are most often red.\n", "hexproof": "Hexproof is a static ability of permanents and players.  A player or permanent with hexproof cannot be the target of spells or abilities controlled by an opponent.  This is similar to shroud, but it does not deny the player (or his or her allies) the ability to target his or her own hexproof permanents.  Cards that previously had or granted this ability were updated via rules errata to have hexproof with the release of the Commander decks. The Dominaria set introduced a variant of this keyword, hexproof from (quality), which (similarly to protection) prevents a permanent or player from being targeted by spells and abilities with listed quality.\n", "indestructible": "A permanent with indestructible can't be destroyed by effects that say \"Destroy\" or by lethal damage.  However, they can be countered, exiled, returned to the hand or library, sacrificed, or killed with effects that lower their toughness to zero.  Initially appearing as a quality, indestructible was changed to a keyword so that it can be removed from a card to make it susceptible to being destroyed.  Indestructible first appeared in Darksteel, chiefly among artifacts made of the titular metal, and has appeared in colored creatures in subsequent sets.\n", "lifelink": "Permanents with lifelink cause their controller to gain life whenever they deal damage equal to the amount of damage dealt.  Lifelink as a keyword was introduced in Future Sight, though the ability had previously existed on numerous cards, with rules errata retroactively changing these to lifelink.  Cards with similar abilities were not changed in this way.  Lifelink was a triggered ability when it was issued but is now a static ability due to the Magic 2010 rules changes.  (Cards that previously had a lifelink-like ability have been issued further errata to return them to their original functionality.  The lone exception to this is the Mirrodin card Loxodon Warhammer, which, since it was reprinted in Tenth Edition with the lifelink keyword, retains that rather than the original functionality on all editions).  Lifelink is found mostly on white cards, and also on black cards.\n", "menace": "A creature with menace can only be blocked by two or more creatures.  Menace was instituted as a keyword in Magic Origins, and was retroactively applied to previous cards with that ability.  Menace appears chiefly on black cards and red cards.\n", "protection": "This ability is written as Protection from (quality).  A creature with protection from a quality cannot be enchanted, equipped, blocked, or targeted by anything with that quality, and all damage that would be dealt by a source of that quality is prevented, barring exceptions which explicitly state otherwise.  For example, a creature with protection from red cannot be enchanted by red auras, blocked by red creatures, targeted by red spells and abilities, or take damage from red sources.  A common mnemonic for which effects are prevented by protection is the acronym DEBT, standing for \"Damage, Enchant (or Equip), Block, Target\".  Note that the protection ability does not prevent effects that do not target.\n", "prowess": "Prowess is a triggered ability.  A creature with prowess gains +1/+1 (until end of turn) whenever a noncreature spell is cast by its controller.  If a creature has multiple instances of prowess, each triggers separately.  Prowess was introduced in Khans of Tarkir and became an evergreen keyword with Magic Origins. Prowess appears chiefly on blue cards, and also on red and some white cards. after the release of Hour of Devastation, Prowess is no longer considered Evergreen, and has a Storm scale value of 4, with complications in interactions cited as the cause. As of Core Set 2021, prowess has experienced somewhat of a comeback.\n", "reach": "Reach is a countermeasure to block creatures with flying. creatures with reach can be blocked by non-flyers.  The keyword was introduced in Future Sight, and the flying rules themselves were changed to clarify this interaction.  Older cards with the ability to \"block as though [they] had flying\" were issued rules errata to have reach.  Reach is found primarily in green creatures, especially Spiders.\n", "trample": "An attacking creature with trample which is blocked may deal any excess damage, above what is needed to kill the blocker, directly to the defending player.  The choice is made by the attacking player, as circumstances can arise in which \"overkilling\" the blocking creature is a more advantageous move.  Trample is most often found on green or red creatures.\n", "vigilance": "Vigilance existed as an ability in Limited Edition Alpha, but was retroactively keyworded beginning with the Kamigawa block. Creatures with vigilance do not tap when attacking (prior to being keyworded, these creatures' rules text read \"Attacking doesn't cause this creature to tap\"), meaning they can still be used during the opponent's turn to block.   Creatures with vigilance are primarily white and secondarily green.\n", "absorb": "This ability is written Absorb x, where x is a quantity of damage prevented on a creature with the ability.  This ability appears on a single timeshifted creature from Future Sight.  Older cards with this ability were not changed to grant absorb.\n", "adapt": "This ability is written (cost): Adapt x and is a tweaked version of the monstrosity mechanic.  If a creature has no +1/+1 counters on it, you may pay the adapt cost to put N +1/+1 counters on that creature.  In comparison to monstrosity, if a creature somehow loses its +1/+1 counters, it can adapt again and pick up more.  Alternatively, one can place counters in response to the activation to stop the creature from getting N counters.  This mechanic first appears in Ravnica Allegiance and is usually associated with the Simic Combine.\n", "affinity": "This ability is written Affinity for (quality).  A card with affinity costs 1 generic mana less to cast for each permanent with that quality under the caster's control.  For instance, an artifact creature that costs 4 generic mana and has 'Affinity for artifacts', would be free if the player casting it controls four or more artifacts, whereas a sorcery with a printed cost of 4 generic mana and 1 blue mana, will cost a single blue mana regardless of whether its caster controls four or five (or more) artifacts.  Affinity appeared throughout the Mirrodin block, usually for artifacts.  A cycle of five cards in Darksteel had affinity for each of the basic land types.\n", "afterlife": "This ability is written Afterlife x.  When a creature with afterlife dies, its controller creates x 1/1 black and white spirit tokens with flying.  This ability first appears in Ravnica Allegiance and is usually associated with the Orzhov Syndicate.\n", "aftermath": "Aftermath is an ability that appears on instant and sorcery split cards (a card with two separate card images printed on its face next to one another).  Only one of the pair of images contains the aftermath ability.  The half of the pair without the aftermath ability can be cast from the player's hand as normal.  Once the physical card is in the player's graveyard (discard pile), the half of the pair that has the aftermath ability can be cast from the graveyard for the cost printed on the upper right of that card, after which the physical card is exiled.  Functionally, this ability is a hybrid of the kicker and flashback abilities.  As with kicker, cards with aftermath have a primary effect and a secondary optional effect that can be produced by paying an additional cost.  As with flashback, the second effect can be cast from the graveyard at a time of the player's choosing.  Aftermath appears in Amonkhet in all five colors, at rarities of uncommon and above.\n", "amplify": "This ability is written Amplify x.  As a creature with amplify enters the battlefield, its controller may reveal any number of creature cards in his or her hand that share a creature type with the creature . That creature enters the battlefield with x +1/+1 counters on it for each card revealed this way.  Amplify only appears in Legions.\n", "annihilator": "This ability is written Annihilator x.  Whenever a creature with annihilator attacks, the defending player sacrifices x permanents.  Annihilator abilities trigger and resolve during the declare attackers step.  The defending player chooses and sacrifices the required number of permanents before he or she declares blockers.  This is a triggered ability that appears exclusively on colorless Eldrazi cards from Rise of the Eldrazi.\n", "ascend": "Ascend is an ability that checks if the player controls ten or more permanents.  On permanent cards, the check is performed constantly; on instants and sorceries, the check is performed as the spell resolves.  Regardless of source, if the player passes the check, they gain a unique quality called city blessing for the rest of the game, which empowers all cards with ascend in various ways.  This mechanic appears in all colors in Rivals of Ixalan set.\n", "aura swap": "This ability is written Aura swap (cost).  By paying the aura swap cost, the player may exchange the Aura with this ability with an Aura card in his or her hand, if he or she controls and owns the Aura with aura swap.  This ability appears on a single timeshifted Aura from Future Sight.\n", "bands with other": "This ability is a limited version of banding, written as Bands with other (quality).  A creature with this ability has banding, but can only band with creatures that have the same ability; e.g. are of the creature type or sub-type (quality), are of the color (quality), and so on.  Unlike normal banding, in an attacking band only one creature is required to have the bands with other (quality) ability, so long as all other creatures in the band have the specified quality.  All other banding rules apply.\n", "battle cry": "When a creature with battle cry attacks, all other attacking creatures get +1/+0 until the end of the turn.  Battle cry was introduced in Mirrodin Besieged and appears on Mirrodin cards.  A card from the Amonkhet set named Honored Crop-Captain has this ability but it was not printed as battle cry but rather spelled out as if the key word did not exist or had been discontinued.  The oracle text[clarification needed] has also not been changed.[relevant?]\n", "bestow": "This ability is written Bestow (cost) and appears on enchantment creatures.  A creature with bestow gives the player the option to cast it as an Aura that enchants a creature, granting that creature its power, toughness, and abilities.  A bestow card cast for its normal cost will enter the stack as a creature spell.  By choosing to pay the alternative cost, which is a static ability, it becomes an Enchantment-Aura spell; if the creature it targets leaves the battlefield before the bestow card resolves or while the bestow card is enchanting the creature, the bestow card enters the battlefield as an enchantment creature – unlike a regular aura card which would become unattached and go to the graveyard.  This mechanic first appeared on some enchantment creatures from the Theros block.\n", "bolster": "This is a keyword action, written Bolster x.  When a player bolsters, the player chooses one of his creatures with the lowest toughness among them and puts x +1/+1 counters on it.  The bolster effect does not target; the choice of creature is made at the resolution of the spell or ability.  It first appeared in Fate Reforged.\n", "bloodthirst": "This ability is written Bloodthirst x.  A creature with bloodthirst x enters the battlefield with x +1/+1 counters on it if an opponent had been damaged during that turn.  Bloodthirst appears in Guildpact and is the ability associated with the Gruul Clans.  It is the returning mechanic in Magic 2012, where it can be found mostly on black and red cards.\n", "bushido": "This ability is written Bushido x.  When a creature with bushido blocks or becomes blocked, it gets +x/+x until end of turn. Bushido appears on all Samurai in the Kamigawa block, and only on Samurai.  Earlier cards with this ability were not given errata to have bushido.\n", "buyback": "This ability is written Buyback (cost).  It appears on instants and sorceries and is an additional, optional cost when casting the card.  If the buyback cost was paid, the card returns to its owner's hand upon resolving, instead of going to the graveyard.  Buyback first appears in the Tempest block.\n", "cascade": "When a spell with cascade is cast, its controller reveals cards from the top of his or her deck until a non-land card that has a lower converted mana cost is revealed.  That player may then (in addition to the original spell) cast the revealed spell without paying its mana cost; all other revealed cards are put on the bottom of the deck in a random order.  Cascade was introduced in Alara Reborn and is the main feature of the \"Chaos Reigns\" deck from the Planechase 2012 expansion.\n", "champion": "This ability is written Champion a (type).  It is an evolution-style mechanic that mimics a creature changing into a \"new improved version\".[10]  When a creature with champion enters the battlefield, its controller must exile a card he or she controls of the appropriate type, or sacrifice the champion.  When the creature with champion leaves the battlefield, the creature it \"championed\" (the exiled card) is returned to the battlefield.  Most creatures with champion replace a creature that shares their own creature type, but those with the changeling ability have the generic \"Champion a creature\". Champion was introduced in Lorwyn.\n", "changeling": "Changeling is a keyword that gives a card all possible creature types, similar to the ability of Mistform Ultimus.  It appears on certain shapeshifter creatures and tribal spells in Lorwyn.\n", "cipher": "Cipher is printed on sorceries and represents two effects.  When a spell with cipher resolves, its controller may exile the spell \"encoded\" on a creature he or she controls.  Then, whenever that creature deals combat damage to an opponent, its controller can cast a free copy of the encoded spell.  Cipher appears in Gatecrash as the guild keyword of House Dimir.\n", "clash": "Clash is a keyword action that determines the results of a spell or ability. When a card says to clash, its controller chooses an opponent to clash with, and each player involved in the clash reveals the top card of his or her deck, then puts it on the top or bottom of that deck.  The winner of the clash is the player who revealed the card with the highest converted mana cost.  If there is a tie, there is no winner. All cards with clash grant a bonus effect if their controller wins the clash. Clash was introduced in Lorwyn.\n", "conspire": "As a player casts a spell with conspire, he or she may pay the optional, additional cost of tapping two creatures that share a color with the spell.  He or she then copies the spell and may choose new targets for the copy.  Conspire appears on instants and sorceries in Shadowmoor.\n", "convoke": "As a spell with convoke is cast, its controller may tap any number of creatures.  Each creature tapped reduces the card's mana cost by 1 generic mana or 1 mana of the tapped creature's color.  For example, a player may pay for Conclave's Blessing, which costs 3 generic and 1 white mana, by tapping four creatures, at least one of which must be white. Convoke appears in Ravnica: City of Guilds and Guilds of Ravnica and is the ability associated with the Selesnya Conclave. Convoke is also the returning keyword mechanic for the Magic 2015 core set, where it appears in all colors.\n", "crew": "This ability is written as Crew x.  It appears only on vehicles, a new subtype of artifacts introduced during the Kaladesh block.  Vehicles are not creatures by default, but have a power and toughness printed in a different colour. A vehicle's controller can pay the crew cost by tapping any number of creatures with total power greater than or equal to x, which turns the vehicle into an artifact creature until end of turn.\n", "cumulative upkeep": "This ability is written Cumulative upkeep (cost).  At the beginning of each of its controller's upkeeps, an \"age counter\" is put on the card.  The player must then either pay the cumulative upkeep cost for each age counter on the permanent, or sacrifice it.  The ability was originally designed to represent an ever-climbing cost, eventually forcing the player to sacrifice the card and lose its benefits, although later incarnations provide a benefit for the number of age counters on the card. The ability first appeared on the card Cyclone from Arabian Nights, and was first keyworded in Ice Age.  The mechanic also appeared in Mirage block, with Weatherlight offering a number of twists on the upkeep cost, and in Coldsnap.\n", "cycling": "This ability is written Cycling (cost).  A player with a card with cycling in hand may pay the cycling cost, discard the card, and draw a new card.  Cycling cards appeared in the Urza block, the Onslaught block, the Alara block, and the Amonkhet block.  A variant of this keyword is typecycling. Future Sight introduced the first cards with unusual Cycling cost, like discarding a card or paying life.\n", "dash": "This ability is written Dash (cost) on creature spells.  A player casting a card with Dash may opt to pay its Dash cost instead of the normal cost.  If the Dash cost is chosen, the creature gains Haste until the end of turn, and is returned to its owner's hand at the end of turn.  The mechanic first appeared in Fate Reforged.\n", "delve": "When playing a card with delve, its controller may exile any number of cards in his or her graveyard.  For each card exiled, the spell costs 1 colorless mana less to play. This ability first appeared on timeshifted cards from Future Sight, and returned in the set Khans of Tarkir .\n", "detain": "Detain is a keyword action introduced in Return to Ravnica that appears on blue and white cards of the Azorius guild.  When a player detains a permanent, the detained permanent can't attack, block, or activate abilities until the start of the player's next turn.[11]\n", "devour": "This ability is written Devour x.  As a creature with devour enters the battlefield, its controller may sacrifice any number of creatures in order to put x +1/+1 counters on the devouring creature for each creature sacrificed. Devour appears on Jund cards in the Alara block.\n", "dredge": "This ability is written Dredge x.  If a card with dredge is in the player's graveyard, that player may put the top x cards of his or her deck into their graveyard and return the card with dredge to his or her hand, instead of drawing a card from their deck.  A player can't do this if there are fewer than x cards in his or her library.  Dredge appears in Ravnica: City of Guilds and is the ability associated with the Golgari Swarm.\n", "echo": "This ability is written Echo (cost).  Cards with echo require their echo cost to be paid at the beginning of their controller's upkeep, the turn after the card was played or gained control of.  If the echo cost is not paid, then the card is sacrificed.\n", "embalm": "This ability is written Embalm (cost) and appears on creature cards.  When a card with this ability is in a player's graveyard, that player may pay its embalm cost to exile the card and put a token into play that is a zombie copy of the creature, in addition to the creature's other creature types (e.g., a Zombie Angel instead of an Angel).  This allows a player to gain a second use from a card with benefits from other cards that interact with zombie creatures.  Embalm is an activated ability (the token is created, not cast) and may be played only when the player could cast a sorcery.  This keyword is similar to flashback, but is found on creature cards rather than instant and sorcery cards.  Embalm appears in Amonkhet, primarily appears on blue and white cards.  Each card with embalm has its own printed token card, with an alternate artwork showing a mummified version of the original creature.\n", "entwine": "This ability is written Entwine (cost).  All cards with entwine are modal spells with two choices.  Normally, a player chooses one mode or the other.  If the card's entwine cost is paid in addition to its regular cost, both effects happen.  Entwine appears in the Mirrodin block.\n", "epic": "Epic has two effects: first, after a player casts a spell with epic, he or she can no longer cast spells for the remainder of the game.  However, at the beginning of each of his or her upkeeps for the rest of the game, the player puts a new copy of the epic spell on the stack.  This doesn't count as \"casting\" it (so it doesn't become a useless ability) and no mana payment is required. Epic appears only on a cycle of five rare sorceries in Saviors of Kamigawa.\n", "evolve": "Evolve is a keyword on creatures which allows them to grow larger.  Whenever a creature enters the battlefield under the player's control, if that creature has larger power or toughness than the creature with evolve, that player can put a +1/+1 counter on the creature with evolve.  Evolve was designed by a contestant during The Great Designer Search II and appears in Gatecrash as the guild keyword of the Simic Combine.\n", "evoke": "This ability is written as Evoke (cost) and is an alternate cost for a creature, generally far lower, with the condition that the creature must be sacrificed upon entering the battlefield.  All cards with evoke have additional effects upon entering or leaving the battlefield.  The creature's controller may choose whether the sacrifice occurs before or after the additional effect(s).[12]\nEvoke appears in Lorwyn and Morningtide.\n", "exalted": "Exalted originally appeared on cards within the Bant colors in the Alara block.  When it reoccurred in Magic 2013, 5 black cards were given the mechanic.  When any creature a player controls attacks alone, it receives +1/+1 until end of turn for each permanent with the exalted keyword that player controls.\n", "exert": "Exert is an ability that appears on creature cards.  Depending on the card, a creature with this ability can be exerted to activate its ability, or can be exerted during attack for an additional bonus,[clarification needed] at a cost of that creature not untapping during its controller's next untap step.  Exert appears in both sets of the Amonkhet block, exclusively on green, red, and white cards.\n", "exploit": "Exploit is an ability that appears on creatures.  It gives the player who casts it the option to sacrifice a creature they control when it enters the battlefield, so that a specified ability will trigger.  Exploit appears in Dragons of Tarkir.\n", "explore": "Explore is a keyword action associated with creatures.  When a creature explores, its controller reveals the top card of their deck . If it is a land card, they put it in their hand; otherwise, they put a +1/+1 counter on that creature and can choose to leave that card on top or send it to their graveyard. Explore appears in both sets of Ixalan block in all five colors.\n", "extort": "Extort is a keyword which allows a player to slowly drain life from opponent(s).  When casting a spell, the player may pay one white or black mana, then each opponent loses one life and the player gains that much life.[clarification needed]  Extort appeared in Gatecrash as the guild keyword for the Orzhov Syndicate\n", "fabricate": "This creature ability is written as Fabricate x.  When this creature enters the battlefield, put x +1/+1 counters on it or create x 1/1 colorless Servo artifact creature tokens.  Fabricate appears in Kaladesh\n", "fading": "This ability is written as Fading x.  A permanent with fading enters the battlefield with x fade counters on it.  At the beginning of its controller's upkeep, a fade counter is removed; if a counter cannot be removed, the card is sacrificed.  Fading is exclusive to Nemesis.  It is extremely similar to the Planar Chaos keyword vanishing.[13]\n", "fateseal": "This keyword action is written Fateseal x.  To fateseal, a player looks at the top x cards of an opponent's deck and may put any number of those cards on the bottom of that player's deck.  Thus, this ability is functionally a scry on the opponent's deck; fateseal was dubbed \"evil scry\" while in design.[14][failed verification] Fateseal exclusively appears on timeshifted cards from Future Sight.\n", "flanking": "When a creature with flanking is blocked by a creature without this ability, the blocking creature gets −1/−1 until end of turn.  The effect is cumulative; multiple instances of flanking will effect a greater penalty, though a blocking creature only needs one instance to avoid the effect.  Flanking first appears in the Mirage block.\n", "flashback": "This ability is written Flashback (cost) and appears on instants and sorceries.  When a card with this ability is in a player's graveyard, that player may pay its flashback cost and cast the card from the graveyard.  The card is then exiled.  This allows a player to get a second use from a card.  Flashback was introduced in the Odyssey block, where cards with an ability that acted from the graveyard have small headstone markers in front of their names.  They reappeared in Time Spiral and Innistrad blocks (without the headstone marker).\n", "flip": "Flip is a keyword action that deals with specially printed cards known as \"flip cards\".  Each of these cards has two sets of normal card attributes (e.g. name, rules text, power and toughness): one right-side-up above the card's image and one upside-down (with no mana cost) below the image. Flip cards enter the battlefield unflipped, with only the former set of attributes applying. Once certain conditions are met, the player flips the card (rotating it 180 degrees) and the second set of attributes come into effect.  Once flipped, a card cannot be unflipped (except by leaving the battlefield and returning), and effects that would \"flip\" a card that is already \"flipped\" do nothing. Flip cards appear in the Kamigawa block.  Although \"flipping\" is often colloquially used to refer to morphing and transforming cards, they are distinct mechanics.\n", "forecast": "This ability is written Forecast — Cost: Effect.  During a player's upkeep, if he or she has a card with forecast in his or her hand, he or she may pay the forecast cost to activate its forecast ability.  The cost always includes revealing the card until the end of the upkeep.  A player can only do this once per turn per forecast card. Forecast appears in Dissension and is the ability associated with the Azorius Senate.\n", "fortify": "This ability is written Fortify (cost).  It is found only on fortifications, a subtype of artifacts.  A player pays the fortify cost as a sorcery (only during their own main phase when the stack is empty) and attaches it to a land he or she controls.  That land becomes \"fortified\" and can then be referenced by the fortification as the \"fortified land\".  Other than attaching to lands instead of creatures, the rules for fortifications are similar to those for equipment.  Fortify appears on a single timeshifted artifact from Future Sight, Darksteel Garrison.\n", "frenzy": "This ability is written Frenzy x.  When a creature with frenzy attacks and is not blocked, it gets + x /+0 until end of turn.  This ability appears on a single timeshifted creature from Future Sight, Frenzy Sliver.\n", "graft": "This ability is written Graft x.  All creatures with graft are 0/0 creatures that enter the battlefield with x +1/+1 counters on them.  Whenever another creature enters the battlefield, a player may move one +1/+1 counter from any number of creatures with graft he or she controls onto that creature.  Graft appears in Dissension and is the ability associated with the Simic Combine.\n", "gravestorm": "When a player casts a spell with gravestorm, he or she puts a copy of that spell on the stack for each permanent that was previously put into a graveyard that turn.  This ability is similar to storm and appears on a single timeshifted card from Future Sight, Bitter Ordeal.\n", "haunt": "Haunt appears on creatures, instants, and sorceries.  When a creature haunt dies or when an instant or sorcery with haunt resolves, the ability triggers causing the card to be exiled \"haunting\" a creature.  Haunt allows a player to use an effect twice: once when the spell is played (or the creature enters the battlefield), and once when the creature it haunts is put into a graveyard.  Haunt appears in Guildpact and is the ability associated with the Orzhov Syndicate.\n", "hideaway": "When a card with hideaway enters the battlefield, its controller chooses one card from the top four of his or her library and exiles that card face-down.  Each card with hideaway also has another ability that allows its controller to play the \"hidden\" card, without paying its mana cost, under certain conditions.  Hideaway appears only on a cycle of lands from Lorwyn, along with a creature from Modern Horizons 1.\n", "horsemanship": "Horsemanship parallels flying in that creatures with horsemanship can only be blocked by other creatures with horsemanship.  There is no exception analogous to reach.  Horsemanship is unique to the Portal Three Kingdoms set, so very few cards make use of the keyword.\n", "infect": "Creatures with infect deal damage to other creatures in the form of −1/−1 counters, similar to wither, and to players in the form of poison counters.  Infect appears on Phyrexian cards in the Scars of Mirrodin block.  A player who receives 10 poison counters loses the game.\n", "jump-start": "Spells with jump-start can be cast from the graveyard with the additional cost of discarding a card.  After the spell leaves the stack, it is exiled. Jump-start appears in Guilds of Ravnica and is associated with the Izzet League. \n", "kicker": "This ability is written Kicker (cost).  The kicker cost is an additional and optional cost that can be paid when the card is cast.  If the card is \"kicked\", an ability of the card takes effect.  Some cards have multiple kicker abilities; a player may choose to pay any, all, or none of these.  Kicker was introduced in the Invasion block and is the returning mechanic in the Zendikar and Dominaria blocks.\n", "level up": "This ability is written Level up (cost).  Any time he or she could cast a sorcery, a player may activate the level up ability of a \"leveler\" creature to put a level counter on it.  Leveler creatures increase in power and gain new abilities as they accumulate level counters, as indicated by the three striped bands in the text box.  Level up appears in Rise of the Eldrazi.\n", "living weapon": "When an equipment with living weapon enters the battlefield, its controller puts a 0/0 black Germ creature token onto the battlefield then attaches that equipment to the token.  All cards with living weapon give the equipped creature a toughness increase to compensate for the Germ's 0 toughness; the player may attach the equipment to a different creature, but the Germ will be instantly sent to the graveyard.  Living weapon was introduced in Mirrodin Besieged and appears on Phyrexian cards.\n", "madness": "This ability is written Madness (cost).  At the time a player discards a card with madness, he or she may pay its madness cost and cast the card. Madness first appeared in Torment, and the rules for madness were subtly shifted for its reappearance in Time Spiral block, where the vast majority of madness cards were black.  A madness cost is usually cheaper than the normal mana cost of a card (but the Future Sight set introduced Ichor Slick whose madness cost is more expensive than its normal cost).  The rules for madness were changed again when it was reintroduced for Shadows over Innistrad.\n", "manifest": "This ability is written Manifest [one or more cards], most frequently manifest the top card of your library.  When you manifest a card, you put it onto the battlefield face down.  This disguises its true identity from your opponents.  While face down, it's a 2/2 colorless creature with no name, no abilities, and no creature types.  Face-down cards act as creatures: they can attack and block, be targeted by spells and abilities affecting creatures, and be modified with auras and equipment.\n", "meld": "Meld is a keyword action where two specific cards can be exiled and then returned to the battlefield transformed and combined into a single horrifying creature. This mechanic is featured in the Eldritch Moon set expansion.\n", "mentor": "Whenever a creature with mentor attacks, a +1/+1 counter may be placed on another attacking creature with lesser power.  If a creature has multiple instances of mentor, each triggers separately.  This ability is featured in the Guilds of Ravnica expansion and is associated with the Boros Legion. \n", "miracle": "This ability is written Miracle (cost).  If the first card a player draws during any turn has miracle, he or she may reveal the card.  If the card is revealed, the player may then cast the card for its miracle cost. Miracle appears in Avacyn Restored.  Cards with miracle have a special border that appears as if the art is bathed in light.\n", "modular": "This ability is written Modular x and only appears on artifact creatures with \"Arcbound\" in the title.  A creature with modular enters the battlefield with x +1/+1 counters on it, and when that creature is put into a graveyard, its controller may put all the +1/+1 counters on that creature onto a target artifact creature.  Modular appeared in Darksteel and on one card in Fifth Dawn (Arcbound Wanderer).\n", "monstrosity": "This ability is written (Cost): Monstrosity x.  If a creature is not monstrous yet, this ability makes that creatures monstrous and it gets x +1/+1 counters.  Some creatures with this ability gain an additional effect once they become monstrous.\n", "morph": "This ability is written Morph (cost).  A card with morph may be cast face-down by paying 3 generic mana. While face-down, the creature is a colorless, nameless and typeless 2/2 creature.  At any time, a player may pay the creature's morph cost and turn the card face-up. Many cards with morph have additional abilities when they are turned face-up. Morph was introduced in the Onslaught block.\n", "multikicker": "Multikicker is a variant of the kicker keyword, written Multikicker (cost), where the cost can be paid any number of times when the card is played, as opposed to the limit of one as defined in the original kicker ability.  Cards with multikicker have an ability that references the number of times the card was \"kicked\". Multikicker appears in the Worldwake set.\n", "ninjutsu": "This ability is written Ninjutsu (cost). If a player has a Ninja in hand and controls an attacking creature the opponent has declined to block, he or she may pay its ninjutsu cost, return the unblocked creature to his or her hand, and put the Ninja onto the battlefield tapped and attacking.  Ninjutsu appears only in Betrayers of Kamigawa and only on Ninja creatures.\n", "offering": "This ability is written (Creature type) offering.  A player may cast a creature with the offering ability as an instant (similar to flash) but must sacrifice a creature of the stated type and pay the difference in mana cost between the sacrificed creature and the creature with offering.  Offering only appears on a cycle of five legendary Spirits in Betrayers of Kamigawa.\n", "overload": "Overload is a keyword for instants and sorceries used by the Izzet League in Return to Ravnica.  By paying the more-expensive overload cost instead of the regular mana cost, the spell can affect all possible targets, rather than a single one.[11]\n", "persist": "When a creature with persist is put into a graveyard from the battlefield, if it had no −1/−1 counters on it, it is returned to the battlefield under its owner's control with a −1/−1 counter on it.  Persist appears in Shadowmoor and Eventide.\n", "poisonous": "This creature ability, written Poisonous x, originated in the Legends set. Whenever a creature with poisonous deals combat damage to a player, that player gets x poison counters.  A player with ten poison counters loses the game.  Cards with the ability appeared in small quantities up to the release of Fifth Edition, after which the ability was retired until Time Spiral block.  Poisonous was keyworded in Future Sight, though older cards with the ability have not been changed to have poisonous due to minor text variations between cards.  This ability was supplanted by the infect ability of the Scars of Mirrodin block.\n", "populate": "Populate is a keyword action introduced in Return to Ravnica that appears on green and white cards of the Selesnya Conclave.  To populate, a player puts a token onto the battlefield that's a copy of a creature token he or she controls.[11]\n", "proliferate": "Proliferate is a keyword action introduced in Scars of Mirrodin.  To proliferate, a player chooses any number of permanents and/or players with a counter (e.g. a Planeswalker loyalty counter, a +1/+1 counter, a poison counter), then gives each exactly one additional counter of a kind that permanent or player already has.\n", "provoke": "When a creature with provoke attacks, its controller may target a creature the defending player controls, forcing it to untap (if it is tapped) and block the attacking creature if it is able to do so.  The ability can choose a creature that can't block the creature with provoke.[further explanation needed]  Provoke is cumulative, though no creature has more than one instance of it.  Provoke only appears in Legions.\n", "prowl": "This ability is written Prowl (cost) and is an alternate cost.  A player can cast a card for its prowl cost if the player controls a creature of the same type which dealt damage to a player that turn.  Most cards with prowl have an additional effect if cast for their prowl cost.  Prowl appears in Morningtide exclusively on cards that contain the Rogue subtype.\n", "rampage": "This ability is written Rampage x.  When a creature with rampage becomes blocked, the creature gains +x/+x until end of turn for each creature beyond the first assigned to block.  Mirage was the last set to print new cards with rampage (although Time Spiral reprinted Craw Giant), and 5th Edition was the only Core Set to include cards with rampage.\n", "rebound": "The rebound ability allows a player to cast an instant or sorcery spell more than once.  When a spell with rebound is cast from a player's hand, that player exiles it, and during his or her next upkeep may cast the spell again without paying its mana cost (similar to suspend).  Rebound was introduced in Rise of the Eldrazi and was brought back in Dragons of Tarkir.\n", "recover": "This ability is written Recover (cost).  Whenever a creature is put into a player's graveyard from the battlefield, all cards with recover in that player's graveyard trigger.  That player may then pay each card's recover cost; if the cost is paid, the card is put into the player's hand, but if it is not paid, the card is exiled.  Recover appears in Coldsnap.\n", "reinforce": "This ability is written Reinforce x — (cost).  A player may discard a card with reinforce from his or her hand, pay its reinforce cost, and put x +1/+1 counters on a target creature.  Reinforce appears in Morningtide.\n", "renown": "This ability is written Renown x (When this creature deals combat damage to a player, if it isn't renowned, put x +1/+1 counters on it and it becomes renowned.)  Renown appears in Magic Origins.\n", "replicate": "This ability is written Replicate (cost).  When a player casts a spell with replicate, he or she may pay the replicate cost any number of times, then put a copy of the spell on the stack for each time the replicate cost was paid.  Replicate appears in Guildpact and is the ability associated with the Izzet League.\n", "retrace": "Retrace appears on instants and sorceries.  It allows players to replay a spell from the graveyard by paying its mana cost and all associated costs with the additional cost of discarding a land card.  Unlike with flashback, a card cast from the graveyard with retrace is not exiled, and returns to the graveyard after it resolves. Retrace appears in Eventide.\n", "riot": "As a creature with riot enters the battlefield, its controller can choose it to enter with a +1/+1 counter or haste.  If a creature has multiple instances of riot, each triggers separately.  Riot appears in Ravnica Allegiance and is usually associated with the Gruul clans. \n", "ripple": "This ability is written Ripple x.  When a spell with ripple is cast, its controller may reveal the top x cards of his or her deck.  If any of them have the same name as the spell with ripple that was cast, then the player can cast those cards without paying their mana costs (this triggers their ripple abilities, so a player can ripple again).  Any cards not thus cast are then put on the bottom of that player's deck.  Ripple appears in Coldsnap, where all cards with the mechanic have ripple 4.\n", "scavenge": "This ability is written Scavenge (cost).  Any time he or she could cast a sorcery, a player may exile a card with scavenge from his or her graveyard to put a number of +1/+1 counters onto a target creature equal to the power of the creature with scavenge.  Scavenge appears on green and black cards of the Golgari Swarm in Return to Ravnica.[11]\n", "shadow": "Creatures with shadow can only block or be blocked by other creatures with the shadow ability.  Shadow was introduced in the Tempest block.\n", "soulbond": "Creatures with soulbond can be paired with other creatures (with or without soulbond) when either creature enters the battlefield.  When paired, each of the paired creatures receives the ability printed on the soulbond creature's card (if both creatures have soulbond, they each receive both abilities).  Creatures remain paired as long as they remain under the control of the caster.  Soulbond appears in Avacyn Restored.\n", "soulshift": "This ability is written Soulshift x.  When a creature with soulshift is put into a graveyard from the battlefield, its controller may return a spirit card with converted mana cost x or less from his or her graveyard to his or her hand.  Almost all cards with soulshift are spirits with a soulshift number one less than their converted mana cost (to prevent them from returning themselves); a notable exception is Promised Kannushi (which is a human druid, not a spirit).  Soulshift appears in the Kamigawa block.\n", "spectacle": "This ability is written Spectacle (cost).  A player can cast a spell for its spectacle cost if an opponent lost life during the turn.  In some cases additional benefits are provided for paying the spectacle cost.  This ability is introduced in Ravnica Allegiance and is associated with the Rakdos Cult. \n", "splice": "This ability is written Splice onto (quality) (cost).  As a player casts a spell with a given quality, he or she may reveal any number of cards in his or her hand with splice onto that quality, and pay their splice costs; each splicing card's effects are added to those of the spell cast, while the cards spliced onto the spell are kept in the player's hand.  These effects are placed after the played spell's effects.  One card, Evermind, has no mana cost (meaning it can't be cast normally), but it does have a splice cost.  Splice appears in the Kamigawa block, where the quality was limited to Arcane.\n", "split second": "While a spell with split second is on the stack, players can't cast spells or activate non-mana abilities.  Triggered abilities and certain special actions that don't use the stack (such as un-morphing a face-down permanent) can be played as normal.  Split second is similar to the defunct interrupt card type, except that a card with split second cannot be cast while another card with split second is on the stack, whereas one interrupt card could be played in response to another.  Split second appears in the Time Spiral block.\n", "storm": "When a spell with storm is played, the player puts a copy of that spell on the stack for each spell cast before the storm spell that turn, getting that many instances of the spell.  Storm was introduced in Scourge.\n", "sunburst": "A permanent with sunburst enters the battlefield with a +1/+1 counter if a creature, or a charge counter otherwise, for each different color of mana spent to pay its mana cost.  Sunburst appears in Fifth Dawn on artifacts.\n", "support": "This ability is written as Support N, and puts a +1/+1 counter on each of up to N target creatures.  Support was introduced in Oath of the Gatewatch and reappeared in Battlebond and Archenemy: Nicol Bolas.\n", "surveil": "To Surveil x, a player looks at the top x cards of his or her library, and put them in the graveyard or on top of their deck in any order.  This mechanic was introduced in Guilds of Ravnica and is associated with House Dimir. \n", "suspend": "This ability is written Suspend x — (cost).  Any time a player could cast a spell with suspend, he or she may instead pay its suspend cost to exile it with x time counters on it.  The player removes a time counter every time his or her upkeep step begins.  (Note that other spells or effects can add or remove time counters from suspended cards.)  When the last counter is removed, the spell is cast without paying its mana cost and, if it is a creature, it gains haste.  Cards may be given suspend and have time counters put on them when they are exiled by an effect.  In particular, a cycle of cards from the Future Sight set can \"re-suspend\" themselves after they resolve.  Suspend appears in the Time Spiral block.\n", "totem armor": "Totem armor is an ability which appears on Auras.  When the enchanted creature would be destroyed, an attached Aura with totem armor is destroyed instead.  Totem armor appears in Rise of the Eldrazi.\n", "transfigure": "This ability is written Transfigure (cost).  Any time a sorcery could be cast, a controlling player may pay a creature's transfigure cost and sacrifice it to search his or her deck for a creature with the same converted mana cost as the sacrificed creature and place it directly onto the battlefield.  It is a variant on the transmute ability.  This ability appears on a single timeshifted creature in Future Sight, Fleshwrither.\n", "transform": "Transform is a keyword action that only appears on double-faced cards.  Each transform card enters the battlefield with its front face up, and when certain conditions are met, the player turns the card over to its other face to transform it.  Transform and double-faced cards were introduced in Innistrad block.  All Werewolf cards from Innistrad and Dark Ascension, among other cards (mostly creatures), have the ability.  Transformed cards retain any enchantments or counters placed on the front face.\n", "transmute": "This ability is written Transmute (cost).  When a sorcery could be cast, a player may pay the transmute cost of a card in their hand and discard it, then search their deck for a card with the same converted mana cost as the discard and put that card in their hand.  Transmute appears in Ravnica: City of Guilds and is the ability associated with House Dimir.\n", "typecycling": "Typecycling is a variant of cycling that is worded (card type)cycling (cost).  When the ability is used the player discards the card, then may search his or her deck for any card containing the indicated subtype and put it in his or her hand.  It first appeared in Scourge as \"Landcycling\", indicating cards which could search for basic lands.  Typecycling was redefined with the release of Future Sight to allow searching for other types of cards, and also appears in Alara block.  Typecycling activates anything that would trigger on cycling.\n", "undying": "When a creature with undying is put into a graveyard from the battlefield, if it had no +1/+1 counters on it, it is returned to the battlefield under its owner's control with a +1/+1 counter.  Undying first appeared in Dark Ascension.  This keyword is very similar to persist.\n", "unearth": "This ability is written Unearth (cost).  If a creature with unearth is in a player's graveyard, any time a sorcery could be played, that player may pay its unearth cost to return that creature to the battlefield.  The creature gains haste and is exiled at the beginning of the next end step, or if it would otherwise leave the battlefield. Unearth appears on Grixis cards in the Alara block.\n", "unleash": "A player may choose to have a creature with unleash enter the battlefield with a +1/+1 counter on it.  If a creature with unleash has a +1/+1 counter on it (whether put there by its own ability or another source), that creature can't block.  Unleash appears on red and black cards of the Cult of Rakdos in Return to Ravnica.[11]\n", "vanishing": "This ability is written Vanishing x.  A permanent with vanishing enters the battlefield with x time counters on it.  At the beginning of its controller's upkeep, a time counter is removed.  When the last counter is removed, the card is sacrificed.  Vanishing was introduced in Time Spiral and is a modification of fading which uses time counters to interact with other Time Spiral cards.\n", "ward": "Whenever this permanent becomes the target of a spell or ability an opponent controls, counter it unless that player pays the associated Ward cost.\n", "wither": "Wither is a replacement ability that modifies damage. Nonlethal damage marked on a creature normally goes away at the end of the turn.  However, whenever a source with wither deals damage to a creature, that creature receives a number of −1/−1 counters equal to the amount of damage dealt to it.  When it deals damage to a player, that player will receive regular damage unlike infect. Wither was introduced in Shadowmoor.\n", "addendum": "Cards with addendum have additional effects if they are cast during their controller's main phase.  All cards with addendum are either instants or permanents with flash.  This ability is first seen in Ravnica Allegiance and is usually associated with the Azorius Senate.\n", "battalion": "Battalion is a creature ability word which gives an advantage whenever the creature attacks with at least two other creatures.  It was designed by a contestant during The Great Designer Search II and appears in Gatecrash as the guild keyword of the Boros Legion\n", "bloodrush": "For a cost, bloodrush allows a creature card to be discarded to give a temporary boost to an attacking creature, equal to the discarded creature's power and toughness and also temporarily granting the discarded creature's abilities.  Bloodrush appeared in Gatecrash as the guild-keyword of the Gruul Clans\n", "channel": "All cards with channel have the ability to be discarded for a cost to yield a specified effect.  Channel appears in Saviors of Kamigawa on spirit creatures, and was introduced specifically for interaction with soulshift.[16]\n", "chroma": "Chroma is an ability of a permanent or spell that checks for specific mana symbols of cards in specific zones.  When a card with chroma is played, it will indicate a specified effect or characteristic-defining ability and repeat it for every color symbol in the checked zone.  Chroma was first introduced in Eventide, and the Phosphorescent Feast card from Future Sight was issued errata to have the ability word.\n", "domain": "Domain refers to an effect that may be stronger or weaker depending on the number of basic land types (Plains, Island, Swamp, Mountain, and/or Forest) among lands a player controls.  The mechanic first appeared in Invasion without the keyword printed on the cards.  Domain officially became an ability word in the Conflux set.\n", "emerge": "Emerge is an ability allowing the player to pay an alternate mana cost by sacrificing a creature and paying the difference between the Emerge cost and the sacrificed creature's converted mana cost. It appears in Shadows over Innistrad on Eldrazi creatures.\n", "enrage": "Enrage is a creature-exclusive ability word, indicating abilities that trigger whenever that creature is dealt damage.  It appears in Ixalan block on white, green and red Dinosaur creatures.\n", "fateful hour": "Cards with fateful hour gain an additional ability if controlled by a player with 5 life or less.  This ability first appeared on human-themed cards in Dark Ascension.\n", "ferocious": "Cards with ferocious gain an additional ability if their controller controls a creature with power four or more.  This ability appears on cards belonging to the Temur clan in Khans of Tarkir and Fate Reforged.\n", "grandeur": "Grandeur is an ability written as Discard another card named (name of card): (effect).  This was designed as a means of reducing the drawback of drawing multiple copies of the same legendary permanent.  This ability appears exclusively on timeshifted legendary cards from Future Sight.\n", "hellbent": "Cards with the hellbent ability word have greater effects if their controller has no cards in his or her hand.  Hellbent appears in Dissension and is associated with the Cult of Rakdos; many other cards pertaining to the Cult function better while their controller has fewer cards in hand.\n", "heroic": "Cards with the heroic ability word gain an advantage when targeted with a spell.  Although there are many heroic effects, the most common use of this mechanic is to give a creature a +1/+1 counter.  This mechanic first appeared with creatures from the Theros block.\n", "imprint": "Imprint is an ability word which only appears on artifacts and creatures.  All cards with imprint have either an activated (Cost: Effect) or triggered ability which allows the player to exile a card to grant abilities to the artifact with imprint.  Imprint was introduced as a keyword in the Mirrodin block and became an ability word in the Scars of Mirrodin block.\n", "join forces": "Join forces is an ability word geared toward multiplayer variants.  An effect denoted with join forces allows all players to contribute to it, usually by paying mana, though that effect might not be mutually beneficial . Join forces appears in Commander.\n", "kinship": "Kinship is an ability word that appears in Morningtide.  All cards with kinship are creatures that check, at the beginning of their controller's upkeep, the top card of that player's deck.  If it shares a creature type with the creature that has the kinship ability, the player may reveal it for a bonus effect.\n", "landfall": "Landfall is an ability word associated with bonuses given to players for playing lands.  Landfall first appeared in Zendikar with abilities of the form Whenever a land enters the battlefield under your control, (effect).  The follow-up set, Worldwake, introduced a modified form of landfall on instant cards written as If a land entered the battlefield under your control this turn, (effect).\n", "metalcraft": "Cards with the metalcraft ability word gain an additional effect while their controller controls three or more artifacts.  Metalcraft appears in the Scars of Mirrodin block and is associated with the Mirran faction.\n", "morbid": "Cards with the morbid ability word gain an additional effect during a turn in which a creature died.  Morbid was introduced in the Innistrad block.\n", "mutate": "If you cast a spell for its mutate cost, put it over or under target non-Human creature you own. They mutate into the creature on top plus all abilities from under it.\n", "radiance": "The radiance ability word denotes abilities that target one permanent, but affect all permanents of the same type that share a color with the target.  Radiance appears in Ravnica: City of Guilds and is associated with the Boros Legion.\n", "raid": "A card with raid gains an additional effect if their controller attacked the turn they are played.  Raid is associated with the Mardu and appears in Khans of Tarkir.  It has reoccurred as a pirate mechanic in Ixalan.\n", "rally": "The \"rally\" mechanic was first introduced in the Battle for Zendikar set, and is a keyword given to the abilities of allies from the original Zendikar set.  A creature with a rally ability triggers whenever an ally enters the battlefield under their control and gives some kind of bonus to all of that player's creatures, even non-ally creatures.\n", "sweep": "Sweep is an ability word used on spells with effects which can be strengthened by returning any number of lands of a single basic land type to their owners' hands.  Sweep only appears on four cards in Saviors of Kamigawa.  Mark Rosewater has opined that labeling this mechanic with an ability word was \"a mistake\".[17]\n", "threshold": "This ability was originally written Threshold — ability.  Whenever a player has seven or more cards in the graveyard, his or her cards gain any threshold abilities they might have.  A player can't activate an ability tied to threshold unless he or she has seven or more cards in the graveyard.  Threshold appears in Odyssey block and on some timeshifted cards in Time Spiral.\n", "undergrowth": "Undergrowth provides benefits depending on the number of creatures in the player's graveyard.  This mechanic appears in Guilds of Ravnica and is associated with the Golgari Swarm.\n", "banding": "Banding is an ability that has defensive and offensive functions.  A defending player determines how combat damage is dealt by an opposing creature if at least one of the creatures blocking has banding (without banding, the attacking player determines this).  An attacking player may form \"bands\" of creatures with banding, which may also include one non-banding creature.  If one creature in the band becomes blocked, the whole band becomes blocked as well, whether or not the defender could block other creatures in the band.  This can allow many small creatures to \"gang up\" on a single bigger creature that would survive blocking any one of these smaller creatures.\n", "bury": "The term bury or buried was used in some early sets, where it served as shorthand for a two-part effect: destroying a permanent, and preventing that permanent from regenerating.  It is still functionally present in the game, with newer cards using a complete explanation for each part of the effect. (e.g. \"Destroy target creature. It cannot be regenerated.\")[20]  Bury is found only in sets prior to Tempest; all cards which contained the term have been issued new wording to use either a \"destroy\" or \"sacrifice\" effect.\n", "fear": "Fear is an example of \"retroactive keywording\", meaning it was an ability that had existed long before it was given a keyword; its eponymous card, Fear, was in the original set Limited Edition Alpha.  Creatures with fear can't be blocked except by black creatures and by artifact creatures.  Fear has almost always appeared on black creatures.  Fear was replaced as a viable keyword by intimidate.[21]\n", "intimidate": "A creature with intimidate can't be blocked except by artifact creatures and creatures that share a color with it.  It first appeared in Zendikar. In 2009, intimidate was announced as an evergreen keyword to replace fear, though it did not appear in a Core Set until Hideous Visage was printed in Magic 2012.  As with fear, intimidate appeared on predominantly black colors, but did appear on other colors, particularly red.  With Magic Origins, intimidate was phased out and supplanted by menace.[21]\n", "landhome": "This ability is written as (land type)home . A creature with landhome may only attack a player who controls a land of the specified land type, and must be sacrificed if its controller does not control at least one land of that same type.  The ability was present since the Limited Editions of the game, and was first keyworded in Mirage with Kukemssa Serpent . The keyworded ability was only printed on blue cards of the \"islandhome\" variety.  The last card to be printed with a keyworded landhome ability was Manta Ray from Weatherlight.\n", "landwalk": "This ability is written as (Land type)walk.  A creature with this ability can not be blocked while the defending player controls at least one land with the printed land type (e.g. a creature with swampwalk can not be blocked if the opponent has a swamp on the battlefield).  This ability is somewhat rare, with swampwalk and plainswalk being the most and least common, respectively. Landwalk is not limited to the five basic lands; for example, cards with legendary landwalk, snow landwalk, and nonbasic landwalk have been printed. Landwalk was discontinued with Magic Origins.\n", "phasing": "Phasing introduced a new rule to the game.  Cards with the status \"phased out\" are treated as though they do not exist except for cards that specifically interact with phased-out cards.  At the beginning of each player's turn, all permanents the player controls which have phasing become \"phased out\", along with anything attached to the phasing cards. Any cards the player controls which were phased out become \"phased in\" and return to the battlefield at the same time.  Phasing in or out does not tap or untap the permanent. A token that phases out ceases to exist, while anything attached to it phases out and does not phase in on the token's controller's next turn. Phasing appears in the Mirage block.  The earlier cards Oubliette and Tawnos's Coffin were reworded to use phasing as well for a time; however, these errata were removed in 2007.[22]\n", "regenerate": "Regenerate represented two related keyword actions.  An ability such as \"Regenerate [this creature]\" could be activated; in this context \"regenerate\" means \"set up a regeneration shield\", which protects the affected permanent from the next time it would be destroyed (either due to damage or to \"destroy\" effects). Instead of being destroyed, the permanent would become tapped and be removed from combat.  The second keyword action refers to when this actually occurs: cards like Skeleton Scavengers have a delayed triggered ability that only triggers when the creature has a destroy effect prevented by its regeneration ability.  This ability was generally found on creatures, though any permanent can be regenerated.\n", "shroud": "A player or permanent with shroud cannot be the target of spells or abilities (even his or her own).  While the keyword \"shroud\" was introduced in Future Sight, the ability itself existed long before, first appearing on Spectral Cloak; cards which featured this ability were all issued rules errata to have or grant \"shroud\". Creatures with shroud are most often on blue or green cards.  It has been supplanted completely by the more flexible Hexproof.\n", "substance": "Substance was a static ability with no effect which was never printed on a Magic card.  It was originally created for the Magic: The Gathering Online release of Mirage, as a cycle of cards such as Armor of Thorns did not work as originally intended under the rules established with the release of 6th Edition.  These cards were all enchantments that could be played as instants, but only lasted for one turn if played as an instant.  Under the newer rules, the original wording would cause the enchantment to leave the battlefield before damage was removed from creatures.  The creation of substance restored the cards' intended functionality.[25]  With the rule changes announced in July 2009,[26] all cards edited to use this keyword were re-edited to no longer use it.  The official text of such cards now reads: \"If you cast [this card] any time a sorcery couldn't have been cast, the controller of the permanent sacrifices it at the beginning of the next cleanup step.\" This maintained the same functionality as the substance keyword, but without some unintended rules quirks.\n"}